SM_для_EDT/src/Documents/рарусУчение/рарусУчение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусУчение</name>
  <posting>Deny</posting>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Капитан</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.рарусВидыМероприятийСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиПланГрафика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоУчения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУчения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчениеПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеУчения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SM_для_EDT/src/InformationRegisters/рарусДанныеПланГрафиковМероприятийСУБ/рарусДанныеПланГрафиковМероприятийСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусДанныеПланГрафиковМероприятийСУБ</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПланирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъектПроверки</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.vftПодразделенияКомпании</types>
      <types>CatalogRef.vftСуда</types>
    </type>
  </resources>
  <resources>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.рарусВидыМероприятийСУБ</types>
    </type>
  </resources>
  <resources>
    <name>Обозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КомментарийТч</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПредыдущаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Documents/рарусУчение/Forms/ВыборПланГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Судно") Тогда
		Судно = Параметры.Судно;
	Иначе
		Отказ = Истина;	
	КонецЕсли;
	
	ЗаполнитьТаблицуЗначенийНаСервере(Судно);
		
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если Элементы.ДанныеДляПодбора.ВыделенныеСтроки.Количество()>0 Тогда	
		Строка = ДанныеДляПодбора.НайтиПоИдентификатору(Элементы.ДанныеДляПодбора.ВыделенныеСтроки[0]);
		ТекущаяСтрока = Строка;
	КонецЕсли;

	Закрыть(ТекущаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуЗначенийНаСервере(ПараметрОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеПланГрафиков.Номер КАК Номер,
	|	ДанныеПланГрафиков.Дата КАК Дата,
	|	ДанныеПланГрафиков.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДанныеПланГрафиков.Наименование КАК Наименование,
	|	ДанныеПланГрафиков.Организация КАК Организация,
	|	ДанныеПланГрафиков.Комментарий КАК Комментарий,
	|	ДанныеПланГрафиков.Статус КАК Статус,
	|	ДанныеПланГрафиков.Согласующий КАК Согласующий,
	|	ДанныеПланГрафиков.Ответственный КАК Ответственный,
	|	ДанныеПланГрафиков.ПериодПланирования КАК ПериодПланирования,
	|	ДанныеПланГрафиков.ДатаНачала КАК ДатаНачала,
	|	ДанныеПланГрафиков.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеПланГрафиков.ОбъектПроверки КАК ОбъектПроверки,
	|	ДанныеПланГрафиков.ВидМероприятия КАК ВидМероприятия,
	|	ДанныеПланГрафиков.Обозначение КАК Обозначение,
	|	ДанныеПланГрафиков.ПериодС КАК ПериодС,
	|	ДанныеПланГрафиков.ПериодПо КАК ПериодПо,
	|	ДанныеПланГрафиков.КомментарийТч КАК КомментарийТч,
	|	ДанныеПланГрафиков.ПредыдущаяДата КАК ПредыдущаяДата
	|ИЗ
	|	РегистрСведений.рарусДанныеПланГрафиковМероприятийСУБ КАК ДанныеПланГрафиков
	|ГДЕ
	|	ДанныеПланГрафиков.ОбъектПроверки = &ОбъектПроверки";
	
	Запрос.УстановитьПараметр("ОбъектПроверки",ПараметрОтбора);
	
	ДанныеДляПодбора.Загрузить(Запрос.Выполнить().Выгрузить());
	 
КонецПроцедуры

#КонецОбласти
